results/spring-quarkus-perf-comparison/2026-01-15_22-42-32/wrk-spring3-jvm-2.log
Running 30s test @ http://localhost:8080/fruits
  2 threads and 100 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    15.62ms   20.61ms 444.60ms   91.56%
    Req/Sec   6390.10    847.91  7897.00     60.00
  191703 requests in 30.029s, 154.60MB read
Requests/sec: 6383.93
Transfer/sec:   5.15MB